PinguinoIDE/pinguino-compilers/windows64/p8/share/gputils/header/p18f86j60.inc
        LIST

;==========================================================================
; Build date : Aug 07 2014
;  MPASM PIC18F86J60 processor include
; 
;  (c) Copyright 1999-2014 Microchip Technology, All rights reserved
;==========================================================================

        NOLIST

;==========================================================================
;  This header file defines configurations, registers, and other useful
;  bits of information for the PIC18F86J60 microcontroller.  These names
;  are taken to match the data sheets as closely as possible.
;
;  Note that the processor must be selected before this file is included.
;  The processor may be selected the following ways:
;
;       1. Command line switch:
;               C:\MPASM MYFILE.ASM /PIC18F86J60
;       2. LIST directive in the source file
;               LIST   P=PIC18F86J60
;       3. Processor Type entry in the MPASM full-screen interface
;       4. Setting the processor in the MPLAB Project Dialog
;==========================================================================

;==========================================================================
;
;       Verify Processor
;
;==========================================================================
        IFNDEF __18F86J60
           MESSG "Processor-header file mismatch.  Verify selected processor."
        ENDIF

;==========================================================================
;       18xxxx Family        EQUates
;==========================================================================
FSR0            EQU 0
FSR1            EQU 1
FSR2            EQU 2

FAST            EQU 1

W               EQU 0
A               EQU 0
ACCESS          EQU 0
BANKED          EQU 1
;==========================================================================

;==========================================================================
;       16Cxxx/17Cxxx Substitutions
;==========================================================================
  #define DDRA  TRISA      ; PIC17Cxxx SFR substitution
  #define DDRB  TRISB      ; PIC17Cxxx SFR substitution
  #define DDRC  TRISC      ; PIC17Cxxx SFR substitution
  #define DDRD  TRISD      ; PIC17Cxxx SFR substitution
  #define DDRE  TRISE      ; PIC17Cxxx SFR substitution

;==========================================================================
;
;       Register Definitions
;
;==========================================================================

;----- Register Files -----------------------------------------------------
MAADR5           EQU  H'0E80'
MAADR6           EQU  H'0E81'
MAADR3           EQU  H'0E82'
MAADR4           EQU  H'0E83'
MAADR1           EQU  H'0E84'
MAADR2           EQU  H'0E85'
MISTAT           EQU  H'0E8A'
EFLOCON          EQU  H'0E97'
EPAUS            EQU  H'0E98'
EPAUSL           EQU  H'0E98'
EPAUSH           EQU  H'0E99'
MACON1           EQU  H'0EA0'
MACON3           EQU  H'0EA2'
MACON4           EQU  H'0EA3'
MABBIPG          EQU  H'0EA4'
MAIPG            EQU  H'0EA6'
MAIPGL           EQU  H'0EA6'
MAIPGH           EQU  H'0EA7'
MAMXFL           EQU  H'0EAA'
MAMXFLL          EQU  H'0EAA'
MAMXFLH          EQU  H'0EAB'
MICMD            EQU  H'0EB2'
MIREGADR         EQU  H'0EB4'
MIWR             EQU  H'0EB6'
MIWRL            EQU  H'0EB6'
MIWRH            EQU  H'0EB7'
MIRD             EQU  H'0EB8'
MIRDL            EQU  H'0EB8'
MIRDH            EQU  H'0EB9'
EHT0             EQU  H'0EC0'
EHT1             EQU  H'0EC1'
EHT2             EQU  H'0EC2'
EHT3             EQU  H'0EC3'
EHT4             EQU  H'0EC4'
EHT5             EQU  H'0EC5'
EHT6             EQU  H'0EC6'
EHT7             EQU  H'0EC7'
EPMM0            EQU  H'0EC8'
EPMM1            EQU  H'0EC9'
EPMM2            EQU  H'0ECA'
EPMM3            EQU  H'0ECB'
EPMM4            EQU  H'0ECC'
EPMM5            EQU  H'0ECD'
EPMM6            EQU  H'0ECE'
EPMM7            EQU  H'0ECF'
EPMCS            EQU  H'0ED0'
EPMCSL           EQU  H'0ED0'
EPMCSH           EQU  H'0ED1'
EPMO             EQU  H'0ED4'
EPMOL            EQU  H'0ED4'
EPMOH            EQU  H'0ED5'
ERXFCON          EQU  H'0ED8'
EPKTCNT          EQU  H'0ED9'
EWRPT            EQU  H'0EE2'
EWRPTL           EQU  H'0EE2'
EWRPTH           EQU  H'0EE3'
ETXST            EQU  H'0EE4'
ETXSTL           EQU  H'0EE4'
ETXSTH           EQU  H'0EE5'
ETXND            EQU  H'0EE6'
ETXNDL           EQU  H'0EE6'
ETXNDH           EQU  H'0EE7'
ERXST            EQU  H'0EE8'
ERXSTL           EQU  H'0EE8'
ERXSTH           EQU  H'0EE9'
ERXND            EQU  H'0EEA'
ERXNDL           EQU  H'0EEA'
ERXNDH           EQU  H'0EEB'
ERXRDPT          EQU  H'0EEC'
ERXRDPTL         EQU  H'0EEC'
ERXRDPTH         EQU  H'0EED'
ERXWRPT          EQU  H'0EEE'
ERXWRPTL         EQU  H'0EEE'
ERXWRPTH         EQU  H'0EEF'
EDMAST           EQU  H'0EF0'
EDMASTL          EQU  H'0EF0'
EDMASTH          EQU  H'0EF1'
EDMAND           EQU  H'0EF2'
EDMANDL          EQU  H'0EF2'
EDMANDH          EQU  H'0EF3'
EDMADST          EQU  H'0EF4'
EDMADSTL         EQU  H'0EF4'
EDMADSTH         EQU  H'0EF5'
EDMACS           EQU  H'0EF6'
EDMACSL          EQU  H'0EF6'
EDMACSH          EQU  H'0EF7'
EIE              EQU  H'0EFB'
ESTAT            EQU  H'0EFD'
ECON2            EQU  H'0EFE'
EIR              EQU  H'0F60'
EDATA            EQU  H'0F61'
ECCP2DEL         EQU  H'0F67'
ECCP2AS          EQU  H'0F68'
ECCP3DEL         EQU  H'0F69'
ECCP3AS          EQU  H'0F6A'
RCSTA2           EQU  H'0F6B'
TXSTA2           EQU  H'0F6C'
TXREG2           EQU  H'0F6D'
RCREG2           EQU  H'0F6E'
SPBRG2           EQU  H'0F6F'
CCP5CON          EQU  H'0F70'
CCPR5            EQU  H'0F71'
CCPR5L           EQU  H'0F71'
CCPR5H           EQU  H'0F72'
CCP4CON          EQU  H'0F73'
CCPR4            EQU  H'0F74'
CCPR4L           EQU  H'0F74'
CCPR4H           EQU  H'0F75'
T4CON            EQU  H'0F76'
PR4              EQU  H'0F77'
TMR4             EQU  H'0F78'
ECCP1DEL         EQU  H'0F79'
ERDPT            EQU  H'0F7A'
ERDPTL           EQU  H'0F7A'
ERDPTH           EQU  H'0F7B'
BAUDCON2         EQU  H'0F7C'
BAUDCTL2         EQU  H'0F7C'
SPBRGH2          EQU  H'0F7D'
BAUDCON          EQU  H'0F7E'
BAUDCON1         EQU  H'0F7E'
BAUDCTL          EQU  H'0F7E'
BAUDCTL1         EQU  H'0F7E'
SPBRGH           EQU  H'0F7F'
SPBRGH1          EQU  H'0F7F'
PORTA            EQU  H'0F80'
PORTB            EQU  H'0F81'
PORTC            EQU  H'0F82'
PORTD            EQU  H'0F83'
PORTE            EQU  H'0F84'
PORTF            EQU  H'0F85'
PORTG            EQU  H'0F86'
PORTH            EQU  H'0F87'
PORTJ            EQU  H'0F88'
LATA             EQU  H'0F89'
LATB             EQU  H'0F8A'
LATC             EQU  H'0F8B'
LATD             EQU  H'0F8C'
LATE             EQU  H'0F8D'
LATF             EQU  H'0F8E'
LATG             EQU  H'0F8F'
LATH             EQU  H'0F90'
LATJ             EQU  H'0F91'
DDRA             EQU  H'0F92'
TRISA            EQU  H'0F92'
DDRB             EQU  H'0F93'
TRISB            EQU  H'0F93'
DDRC             EQU  H'0F94'
TRISC            EQU  H'0F94'
DDRD             EQU  H'0F95'
TRISD            EQU  H'0F95'
DDRE             EQU  H'0F96'
TRISE            EQU  H'0F96'
DDRF             EQU  H'0F97'
TRISF            EQU  H'0F97'
DDRG             EQU  H'0F98'
TRISG            EQU  H'0F98'
DDRH             EQU  H'0F99'
TRISH            EQU  H'0F99'
DDRJ             EQU  H'0F9A'
TRISJ            EQU  H'0F9A'
OSCTUNE          EQU  H'0F9B'
PIE1             EQU  H'0F9D'
PIR1             EQU  H'0F9E'
IPR1             EQU  H'0F9F'
PIE2             EQU  H'0FA0'
PIR2             EQU  H'0FA1'
IPR2             EQU  H'0FA2'
PIE3             EQU  H'0FA3'
PIR3             EQU  H'0FA4'
IPR3             EQU  H'0FA5'
EECON1           EQU  H'0FA6'
EECON2           EQU  H'0FA7'
RCSTA            EQU  H'0FAB'
RCSTA1           EQU  H'0FAB'
TXSTA            EQU  H'0FAC'
TXSTA1           EQU  H'0FAC'
TXREG            EQU  H'0FAD'
TXREG1           EQU  H'0FAD'
RCREG            EQU  H'0FAE'
RCREG1           EQU  H'0FAE'
SPBRG            EQU  H'0FAF'
SPBRG1           EQU  H'0FAF'
T3CON            EQU  H'0FB1'
TMR3             EQU  H'0FB2'
TMR3L            EQU  H'0FB2'
TMR3H            EQU  H'0FB3'
CMCON            EQU  H'0FB4'
CVRCON           EQU  H'0FB5'
ECCP1AS          EQU  H'0FB6'
CCP3CON          EQU  H'0FB7'
ECCP3CON         EQU  H'0FB7'
CCPR3            EQU  H'0FB8'
CCPR3L           EQU  H'0FB8'
CCPR3H           EQU  H'0FB9'
CCP2CON          EQU  H'0FBA'
ECCP2CON         EQU  H'0FBA'
CCPR2            EQU  H'0FBB'
CCPR2L           EQU  H'0FBB'
CCPR2H           EQU  H'0FBC'
CCP1CON          EQU  H'0FBD'
ECCP1CON         EQU  H'0FBD'
CCPR1            EQU  H'0FBE'
CCPR1L           EQU  H'0FBE'
CCPR1H           EQU  H'0FBF'
ADCON2           EQU  H'0FC0'
ADCON1           EQU  H'0FC1'
ADCON0           EQU  H'0FC2'
ADRES            EQU  H'0FC3'
ADRESL           EQU  H'0FC3'
ADRESH           EQU  H'0FC4'
SSP1CON2         EQU  H'0FC5'
SSPCON2          EQU  H'0FC5'
SSP1CON1         EQU  H'0FC6'
SSPCON1          EQU  H'0FC6'
SSP1STAT         EQU  H'0FC7'
SSPSTAT          EQU  H'0FC7'
SSP1ADD          EQU  H'0FC8'
SSPADD           EQU  H'0FC8'
SSP1BUF          EQU  H'0FC9'
SSPBUF           EQU  H'0FC9'
T2CON            EQU  H'0FCA'
PR2              EQU  H'0FCB'
TMR2             EQU  H'0FCC'
T1CON            EQU  H'0FCD'
TMR1             EQU  H'0FCE'
TMR1L            EQU  H'0FCE'
TMR1H            EQU  H'0FCF'
RCON             EQU  H'0FD0'
WDTCON           EQU  H'0FD1'
ECON1            EQU  H'0FD2'
OSCCON           EQU  H'0FD3'
T0CON            EQU  H'0FD5'
TMR0             EQU  H'0FD6'
TMR0L            EQU  H'0FD6'
TMR0H            EQU  H'0FD7'
STATUS           EQU  H'0FD8'
FSR2L            EQU  H'0FD9'
FSR2H            EQU  H'0FDA'
PLUSW2           EQU  H'0FDB'
PREINC2          EQU  H'0FDC'
POSTDEC2         EQU  H'0FDD'
POSTINC2         EQU  H'0FDE'
INDF2            EQU  H'0FDF'
BSR              EQU  H'0FE0'
FSR1L            EQU  H'0FE1'
FSR1H            EQU  H'0FE2'
PLUSW1           EQU  H'0FE3'
PREINC1          EQU  H'0FE4'
POSTDEC1         EQU  H'0FE5'
POSTINC1         EQU  H'0FE6'
INDF1            EQU  H'0FE7'
WREG             EQU  H'0FE8'
FSR0L            EQU  H'0FE9'
FSR0H            EQU  H'0FEA'
PLUSW0           EQU  H'0FEB'
PREINC0          EQU  H'0FEC'
POSTDEC0         EQU  H'0FED'
POSTINC0         EQU  H'0FEE'
INDF0            EQU  H'0FEF'
INTCON3          EQU  H'0FF0'
INTCON2          EQU  H'0FF1'
INTCON           EQU  H'0FF2'
PROD             EQU  H'0FF3'
PRODL            EQU  H'0FF3'
PRODH            EQU  H'0FF4'
TABLAT           EQU  H'0FF5'
TBLPTR           EQU  H'0FF6'
TBLPTRL          EQU  H'0FF6'
TBLPTRH          EQU  H'0FF7'
TBLPTRU          EQU  H'0FF8'
PC               EQU  H'0FF9'
PCL              EQU  H'0FF9'
PCLATH           EQU  H'0FFA'
PCLATU           EQU  H'0FFB'
STKPTR           EQU  H'0FFC'
TOS              EQU  H'0FFD'
TOSL             EQU  H'0FFD'
TOSH             EQU  H'0FFE'
TOSU             EQU  H'0FFF'

;----- MISTAT Bits -----------------------------------------------------
BUSY             EQU  H'0000'
SCAN             EQU  H'0001'
NVALID           EQU  H'0002'


